iTower_20__GIS_Управление_пространственными_данными/src/Documents/гисВводЗначенийПоказателейПоОбъекту/гисВводЗначенийПоказателейПоОбъекту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гисВводЗначенийПоказателейПоОбъекту</name>
  <registerRecords>InformationRegister.гисЗначенияПоказателейОбъектов</registerRecords>
  <attributes>
    <name>ОбъектКарты</name>
    <type>
      <types>CatalogRef.гисОбъектыКарты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Значения</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.гисПоказатели</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>Number</types>
        <types>CatalogRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

iTower_20__GIS_Управление_пространственными_данными/src/Enums/гисПоказателиТипы/гисПоказателиТипы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гисПоказателиТипы</name>
  <enumValues>
    <name>Число</name>
  </enumValues>
  <enumValues>
    <name>Булево</name>
  </enumValues>
  <enumValues>
    <name>Справочник</name>
  </enumValues>
</mdclass:Enum>

iTower_20__GIS_Управление_пространственными_данными/src/Catalogs/гисПоказатели/гисПоказатели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гисПоказатели</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТипЗначения</name>
    <type>
      <types>EnumRef.гисПоказателиТипы</types>
    </type>
  </attributes>
  <attributes>
    <name>СправочникИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СправочникВладелецЗначений</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЗнаков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.гисПоказателиПериодичность</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СлоиКарты</name>
    <attributes>
      <name>СлойКарты</name>
      <type>
        <types>CatalogRef.гисСлоиКарты</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсплывающееСообщение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонРасчета</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Детализация</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЦветаПоказателей</name>
    <attributes>
      <name>КлючСтрокиСлоиКарты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цвет</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеОт</name>
      <type>
        <types>Boolean</types>
        <types>Number</types>
        <types>CatalogRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подпись</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

iTower_20__GIS_Управление_пространственными_данными/src/Documents/гисВводЗначенийПоказателейПоОбъекту/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыЗначения

&НаКлиенте
Процедура ЗначенияПоказательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.гисПоказатели.ФормаВыбора", Новый Структура("ТекущаяСтрока,МножественныйВыбор", Элементы.Значения.ТекущиеДанные.Показатель, Истина), ЭтотОбъект, , , ,
		Новый ОписаниеОповещения("ЗначенияПоказательНачалоВыбораЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияПоказательНачалоВыбораЗавершение(МассивЗначений, ДополнительныеПараметры) Экспорт
	Если МассивЗначений <> Неопределено Тогда
		ПервоеЗначение = Истина;
		Для Каждого Значение Из МассивЗначений Цикл
			// пока не заполним текущую строку, новые строки не добавляем
			Если ПервоеЗначение Тогда
				Если Элементы.Значения.ТекущиеДанные.Показатель <> Значение И 
					УжеЕстьПоказатель(Значение) Тогда
					ТекстСообщения = НСтр("ru = 'Показатель %1 уже есть в таблице!'; en = 'Indicator %1 is already in the table!'");
					ОбщегоНазначенияКлиент.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Значение));
					Продолжить;
				КонецЕсли;
				Элементы.Значения.ТекущиеДанные.Показатель = Значение;
				ПервоеЗначение = Ложь;
			Иначе
				Если УжеЕстьПоказатель(Значение) Тогда
					ТекстСообщения = НСтр("ru = 'Показатель %1 уже есть в таблице!'; en = 'Indicator %1 is already in the table!'");
					ОбщегоНазначенияКлиент.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Значение));
					Продолжить;
				КонецЕсли;
				НоваяСтрока = Объект.Значения.Добавить();
				НоваяСтрока.Показатель = Значение;
				
				УстановитьТипЗначенияНаСервере(НоваяСтрока.Показатель, НоваяСтрока.Значение);
			КонецЕсли;
		КонецЦикла;
		ОбновитьОтображениеДанных();
		ЗначенияПоказательПриИзменении(Элементы.ЗначенияПоказатель);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияПоказательПриИзменении(Элемент)
	УстановитьТипЗначенияНаСервере(Элементы.Значения.ТекущиеДанные.Показатель, Элементы.Значения.ТекущиеДанные.Значение);
КонецПроцедуры


&НаКлиенте
Процедура ЗначенияЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если ЭтоСправочник(Элементы.Значения.ТекущиеДанные.Показатель) Тогда
		ВладелецЗначений = ПолучитьВладельцаЗначений(Элементы.Значения.ТекущиеДанные.Показатель);
		Если ЗначениеЗаполнено(ВладелецЗначений) Тогда
			НовыйПараметр = Новый ПараметрВыбора("Отбор.Владелец", ВладелецЗначений);
			НовыйМассив = Новый Массив();
			НовыйМассив.Добавить(НовыйПараметр);
			НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
			Элемент.ПараметрыВыбора = НовыеПараметры;
		Иначе
			НовыйМассив = Новый Массив();
			НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
			Элемент.ПараметрыВыбора = НовыеПараметры;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура УстановитьТипЗначенияНаСервере(Показатель, Значение)
	ТипПоказателя = Справочники.гисПоказатели.ПолучитьТипЗначения(Показатель.ТипЗначения, Показатель.СправочникИмя);
	Значение = ТипПоказателя.ПривестиЗначение(Значение);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоСправочник(Показатель)
	Возврат Показатель.ТипЗначения = Перечисления.гисПоказателиТипы.Справочник;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВладельцаЗначений(Показатель)
	Возврат Показатель.ВладелецЗначений;
КонецФункции


&НаКлиенте
Функция УжеЕстьПоказатель(ТекущийОбъект)
	Строки = Объект.Значения.НайтиСтроки(Новый Структура("Показатель", ТекущийОбъект));
	Возврат Строки.Количество() > 0;
КонецФункции

#КонецОбласти
